experimental/fsi3/fluid/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

    transportModel Newtonian;

    rho rho [1 -3 0 0 0 0 0 ] 1000.0;
    nu nu [0 2 -1 0 0 0 0 ] 0.001;
    pRef pRef [1 -1 -2 0 0 0 0 ] 0.0;
